# Module 3 - Data Manipulation

In [5]:
import pandas as pd
import numpy as np

### Delete Duplicate Data

In [3]:
#create duplicate data
names = ['Jessica','John','Bob','Jessica','Mary','John','Mel','Mel']
grades = [95,78,76,95,77,78,99,100]
GradeList = list(zip(names,grades))
df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

     Names  Grades
0  Jessica      95
1     John      78
2      Bob      76
3  Jessica      95
4     Mary      77
5     John      78
6      Mel      99
7      Mel     100

In [4]:
df.head(10)

     Names  Grades
0  Jessica      95
1     John      78
2      Bob      76
3  Jessica      95
4     Mary      77
5     John      78
6      Mel      99
7      Mel     100

In [ ]:
dupe = df.duplicated() #creates list of True/False values
df[dupe] #shows rows where duplicated is True

In [ ]:
#drops duplicate rows, default is to keep first observation
nodupedf = df.drop_duplicates()
nodupedf.count()

In [ ]:
#keep last observation
df.drop_duplicates(['Names'], keep='last')

### Select Rows by a Condition

In [7]:
#create fake data

names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,-2,77,78,101]

GradeList = list(zip(names,grades))

df = pd.DataFrame(data = GradeList, columns=['Names', 'Grades'])
df

     Names  Grades
0      Bob      76
1  Jessica      -2
2     Mary      77
3     John      78
4      Mel     101

In [ ]:
#find rows equal to 101
df.loc[df['Grades'] == 101]

In [ ]:
#finds rows where the grade is less than or equal to 100
df.loc[df['Grades'] <= 100]

In [6]:
# multiple conditions
df.loc[(df['Names'] == 'Bob') & (df['Grades'] == 76)]

  Names  Grades
0   Bob      76

In [ ]:
# multiple conditions
df.loc[(df['Grades'] >= 60) & (df['Grades'] < 100)] #between 60 and 100

In [ ]:
#replacing values with new value
df.loc[df['Grades'] <= 77, 'Grades'] = 100
df

### Missing Data

In [ ]:
df = pd.read_csv("datasets/gradedatamissing.csv")
df.head()

In [ ]:
# Count null values for each column
df.isnull().sum()

In [ ]:
# Get null values for a specific row
df[df["age"].isnull()]

In [ ]:
#Selecting rows with no missing age or gender
df[df['age'].notnull() & df['gender'].notnull()]

In [ ]:
# drop rows with any missing data
df_no_missing = df.dropna()
df_no_missing.head()

In [ ]:
# The new data frame does not have missing values
df_no_missing.isnull().sum()

In [ ]:
#replace empty cells with 0
df.fillna(0)

In [ ]:
# replace an empty cell with 0
df['grade'].fillna(0)

In [ ]:
# replace empty cells with average of column
df["grade"].fillna(df["grade"].mean(), inplace=True)

### Binning Data
- Data binning, which is also known as bucketing or discretization, is a technique used in data processing and statistics.
- This means that the original data values, will be assigned to a bin into wich they fit according to their size. The original values will be replaced by values representing the corresponding intervals.
- The result of the Pandas function "cut" is a so-called "Categorical object". Each bin is a category.

In [8]:
filepath = "datasets/gradedata.csv"
df = pd.read_csv(filepath)

df.head()

,fname,lname,gender,age,exercise,hours,grade,address
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747"
1,Kadeem,Morrison,male,18,4,4,78.1,"33 Spring Dr., Taunton, MA 02780"
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060"
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125"
4,Noelani,Cherry,female,18,4,15,87.5,"8304 Charles Rd., Lewis Center, OH 43035"

In [9]:
df['grade'].dtypes

dtype('float64')

In [10]:
#Define bins as 0-59, 60-69, 70-79, 80-89, 90-100
bins = [0, 60, 70, 80, 90, 100]

# Create names for the five groups
group_names = ['F', 'D', 'C', 'B', 'A']

#make new column with letter grades
df['lettergrade'] = pd.cut(df['grade'], bins, labels=group_names)
df.head()

,fname,lname,gender,age,exercise,hours,grade,address,lettergrade
0,Marcia,Pugh,female,17,3,10,82.4,"9253 Richardson Road, Matawan, NJ 07747",B
1,Kadeem,Morrison,male,18,4,4,78.1,"33 Spring Dr., Taunton, MA 02780",C
2,Nash,Powell,male,18,5,9,79.3,"41 Hill Avenue, Mentor, OH 44060",C
3,Noelani,Wagner,female,14,2,7,83.2,"8839 Marshall St., Miami, FL 33125",B
4,Noelani,Cherry,female,18,4,15,87.5,"8304 Charles Rd., Lewis Center, OH 43035",B

In [ ]:
pd.value_counts(df['lettergrade']) # number of observations per letter grade

In [ ]:
df.groupby('lettergrade')['hours'].mean() #mean of hours studied per letter grade

In [ ]:
#apply functions to data
df['grade'] = df['grade'].apply(lambda x: int(x)) #turns float type grades to int type
df.head()

### Add and Remove Columns

In [13]:
#SETUP: Make dataframe from lists

#make lists of data
names = ['Bob','Jessica','Mary','John','Mel']
grades = [76,95,77,78,99]
bsdegress = [1,1,0,0,1]
msdegrees = [2,1,0,0,0]
phddegrees = [0,1,0,0,0]

#zip lists together
GradeList = list(zip(names,grades,bsdegress,msdegrees,phddegrees))

#make dataframe from zipped lists
df = pd.DataFrame(data = GradeList, columns=['Names','Grades','BS','MS','PhD'])
df

     Names  Grades  BS  MS  PhD
0      Bob      76   1   2    0
1  Jessica      95   1   1    1
2     Mary      77   0   0    0
3     John      78   0   0    0
4      Mel      99   1   0    0

In [14]:
#make a new column with each value = 0
df['HighSchool']=0

#make new column with all NaN values
df['Preschool'] = np.nan

#manually add data for new column
d = ([0,1,0,1,0])
s = pd.Series(d, index= df.index)
df['DriversLicense'] = s

df

     Names  Grades  BS  MS  PhD  HighSchool  Preschool  DriversLicense
0      Bob      76   1   2    0           0        NaN               0
1  Jessica      95   1   1    1           0        NaN               1
2     Mary      77   0   0    0           0        NaN               0
3     John      78   0   0    0           0        NaN               1
4      Mel      99   1   0    0           0        NaN               0

In [15]:
#drop completely empty columns (all NaN/null values)
#default is how=any (if any of the values are null, drop the column)
df.dropna(axis=1, how='all')

     Names  Grades  BS  MS  PhD  HighSchool  DriversLicense
0      Bob      76   1   2    0           0               0
1  Jessica      95   1   1    1           0               1
2     Mary      77   0   0    0           0               0
3     John      78   0   0    0           0               1
4      Mel      99   1   0    0           0               0

In [16]:
#drop a column
df.drop('PhD', axis=1)

     Names  Grades  BS  MS  HighSchool  Preschool  DriversLicense
0      Bob      76   1   2           0        NaN               0
1  Jessica      95   1   1           0        NaN               1
2     Mary      77   0   0           0        NaN               0
3     John      78   0   0           0        NaN               1
4      Mel      99   1   0           0        NaN               0

#### Other way to remove columns

In [17]:
df.head()

     Names  Grades  BS  MS  PhD  HighSchool  Preschool  DriversLicense
0      Bob      76   1   2    0           0        NaN               0
1  Jessica      95   1   1    1           0        NaN               1
2     Mary      77   0   0    0           0        NaN               0
3     John      78   0   0    0           0        NaN               1
4      Mel      99   1   0    0           0        NaN               0

In [18]:
df.drop(columns=['HighSchool','DriversLicense' ], inplace=True)
df.head()

     Names  Grades  BS  MS  PhD  Preschool
0      Bob      76   1   2    0        NaN
1  Jessica      95   1   1    1        NaN
2     Mary      77   0   0    0        NaN
3     John      78   0   0    0        NaN
4      Mel      99   1   0    0        NaN

#### Removing rows

In [19]:
df.head()

     Names  Grades  BS  MS  PhD  Preschool
0      Bob      76   1   2    0        NaN
1  Jessica      95   1   1    1        NaN
2     Mary      77   0   0    0        NaN
3     John      78   0   0    0        NaN
4      Mel      99   1   0    0        NaN

In [20]:
# Example 1: index position number
df.drop(df.index[0], inplace = True)
df.head()

     Names  Grades  BS  MS  PhD  Preschool
1  Jessica      95   1   1    1        NaN
2     Mary      77   0   0    0        NaN
3     John      78   0   0    0        NaN
4      Mel      99   1   0    0        NaN

In [21]:
# Example 2: a range of index position numbers, las number is not inclusive
df.drop(df.index[1:3], inplace = True)
df.head()

     Names  Grades  BS  MS  PhD  Preschool
1  Jessica      95   1   1    1        NaN
4      Mel      99   1   0    0        NaN

In [22]:
df.head()

     Names  Grades  BS  MS  PhD  Preschool
1  Jessica      95   1   1    1        NaN
4      Mel      99   1   0    0        NaN

In [ ]:
# Example 3: Removing rows according to a specific value
df.drop(df[df['Names']=='Mary'].index, inplace=True)

#### Make new columns

In [ ]:
#using functions
filepath = "datasets/gradedata.csv"
df = pd.read_csv(filename)

def singlename(fn, ln):
    return fn + " " + ln

df['fullname'] = singlename(df['fname'], df['lname'])
df.head()

In [ ]:
#create column based on binary conditional
df['isFailing'] = np.where(df['grade']<70, 'yes', 'no')
df.tail()

In [ ]:
#make numeric value column based on string value column

#create a function that will return 1 if female and 0 if male
def str_to_num(x):
    if x=='female':
        return 1
    if x=='male':
        return 0
    
df['gender_val'] = df['gender'].apply(str_to_num)
df.tail()

### Sort Values

In [ ]:
#still using gradedata.csv
#df.head() if need to see first five rows

df.sort_values('hours') #default is ascending=True
#does not change structure of "df" variable name

### Calculate and Remove Outliers
- In statistics, an `outlier` is an observation point that is distant from other observations.The `outliers` can be a result of a mistake during data collection or it can be just an indication of variance in your data.

### What is the impact of an outlier?
It causes serious issues for statistical analysis:
- Skew the data
- Significant impact on mean
- Significant impact on standard deviation.

### How can we identify an outlier?
- Using Standard Deviation method
- Using the IQR interquartile range

### Visually
- Using scatter plots
- Using Box and whisket plots

### Standard Deviation method

In [ ]:
#still using gradedata.csv
#check df.head() if needed

#Standard Deviation Method

meangrade = df['grade'].mean()
stdgrade = df['grade'].std()
toprange = meangrade + stdgrade * 1.96
botrange = meangrade - stdgrade * 1.96

newdf = df.copy() #to not mess up the original df
newdf = newdf.drop(newdf[newdf['grade'] > toprange].index)
newdf = newdf.drop(newdf[newdf['grade'] < botrange].index)

newdf.head()

### Using IQR method
`IQR tells how spread the middle values are`. It can be used to tell when a value is too far from the middle.
An outlier is a point which falls more than 1.5 times the interquartile range above the third quartile or below the first quartile.

- Arrange the data in increasing order
- Calculate first(q1) and third quartile(q3)
- Find interquartile range (q3-q1)
- Find lower bound q1*1.5
- Find upper bound q3*1.5
- Anything that lies outside of lower and upper bound is an outlier

In [ ]:
#Interquartile Range Method

q1 = df['grade'].quantile(.25)
q3 = df['grade'].quantile(.75)
iqr = q3-q1
toprange = q3 + iqr * 1.5
botrange = q1 - iqr * 1.5

newdf = df.copy()
newdf = newdf.drop(newdf[newdf['grade'] > toprange].index)
newdf = newdf.drop(newdf[newdf['grade'] < botrange].index)

newdf.head()

<img src="https://www.datavedas.com/wp-content/uploads/2018/01/2.1.1.3-Outlier-Treatment-1080x698.png">